[
  {
    "title": "CNBC Daily Open: Elon Musk's companies report positive developments amid his return to work - CNBC",
    "source": "CNBC",
    "url": "https://www.cnbc.com/2025/06/03/cnbc-daily-open-good-news-for-musks-companies-amid-his-return-to-work.html",
    "content_preview": "Elon Musk laughs during a press event with US President Donald Trump in the Oval Office of the White House in Washington, DC, on May 30, 2025. Allison Robbert | AFP | Getty Images\n\nTaken from CNBC’s Daily Open, our international markets newsletter — Subscribe today\n\nIn his first week away from the U.S. government's so-called Department of Government Efficiency, Elon Musk is seeing positive activity in his companies. His brain tech startup Neuralink announced a $650 million funding round, while h...",
    "scraped_at": "2025-06-04 03:53:56.345562",
    "has_embedding": true
  },
  {
    "title": "Stock futures slip after S&P 500 kicks off June with a modest gain: Live updates - CNBC",
    "source": "CNBC",
    "url": "https://www.cnbc.com/2025/06/02/stock-market-today-live-updates.html",
    "content_preview": "Traders work on the floor of the New York Stock Exchange on May 1, 2025.\n\nThe S&P 500 rose Tuesday, fueled by strong gains in AI leader Nvidia , as investors anticipated details on potential U.S. trade deals.\n\nThe broad market index added 0.58% to close at 5,970.37, while the Dow Jones Industrial Average gained 214.16 points, or 0.51%, ending at 42,519.64. The Nasdaq Composite climbed 0.81% and settled at 19,398.96.\n\nNvidia, along with other chip stocks, helped drive this advance. The dominant m...",
    "scraped_at": "2025-06-04 03:53:57.899407",
    "has_embedding": true
  },
  {
    "title": "Dave’s Hot Chicken sold to Subway owner Roark Capital in a $1 billion deal - AP News",
    "source": "Associated Press",
    "url": "https://apnews.com/article/daves-hot-chicken-roark-caca42cedf915683a4707a77248b9c45",
    "content_preview": "Dave’s Hot Chicken said Monday it has been acquired by the private equity firm Roark Capital in a deal valued at $1 billion.\n\nDave’s Hot Chicken got its start in 2017 as a popup in a Los Angeles parking lot. It has grown exponentially since then and expects to end this year with 400 restaurants worldwide. The brand specializes in Nashville-style hot chicken.\n\nInvestors in Dave’s Hot Chicken have included the rapper Drake, who gives away hot chicken sliders every year on Oct. 24, his birthday.\n\nA...",
    "scraped_at": "2025-06-04 03:53:59.485935",
    "has_embedding": true
  },
  {
    "title": "To prevent blackouts, Trump administration keeps another aging power plant online through summer - AP News",
    "source": "Associated Press",
    "url": "https://apnews.com/article/trump-pennsylvania-eddystone-power-plant-e5eb5295a6b8de72636a9478e06fec4b",
    "content_preview": "HARRISBURG, Pa. (AP) — The U.S. Department of Energy has ordered another power plant, this time an oil and gas plant in Pennsylvania, to keep its turbines running through the hottest summer months as a precaution against electricity shortfalls in the 13-state mid-Atlantic grid.\n\nThe department’s order to the grid operator, PJM Interconnection, regarding the Eddystone power plant just south of Philadelphia on the Delaware River, is the department’s second use of federal power under President Dona...",
    "scraped_at": "2025-06-04 03:54:01.035715",
    "has_embedding": true
  },
  {
    "title": "Uber Promotes Company Veteran to COO as CEO Says He’s Not Going ‘Anywhere’ - Bloomberg",
    "source": "Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-06-02/uber-promotes-company-veteran-to-coo-ceo-says-he-s-not-going-anywhere",
    "content_preview": "Uber Technologies Inc. named longtime executive Andrew Macdonald as its first chief operating officer since 2019, part of an executive shake-up that includes the departure of the company’s top delivery leader.\n\nPierre-Dimitri Gore-Coty , senior vice president of delivery, has decided to leave Uber after nearly 13 years, Chief Executive Officer Dara Khosrowshahi said in a memo seen by Bloomberg News. In his place, the company is promoting Macdonald, Gore-Coty’s counterpart for the mobility unit, ...",
    "scraped_at": "2025-06-04 03:54:03.050502",
    "has_embedding": true
  },
  {
    "title": "What is Palantir? The secretive tech company behind Trump's data collection efforts - Mashable",
    "source": "Mashable",
    "url": "https://mashable.com/article/what-is-palantir-trump-data-collection-database",
    "content_preview": "Trump wants to create a master database on Americans. Palantir is the company he wants carrying it out.\n\nTrump wants to create a master database on Americans. Palantir is the company he wants carrying it out. Credit: Jakub Porzycki/NurPhoto via Getty Images\n\nLast Friday, the New York Times published an explosive report on the Trump administration's work with Palantir, which could result in the creation of a master database with information on every single American. Per the Times, if this type of...",
    "scraped_at": "2025-06-04 03:54:13.321246",
    "has_embedding": true
  },
  {
    "title": "Paramount Schedules Annual Shareholder Meeting, Sets Board Expansion Amid Skydance Merger Watch - Deadline",
    "source": "Deadline",
    "url": "http://deadline.com/2025/06/paramount-sets-annual-shareholder-meeting-skydance-merger-1236420893/",
    "content_preview": "Paramount Global has set its annual shareholder meeting for July 2, offering the latest signal that the long-gestating merger with Skydance Media is unlikely to close on schedule.\n\nIn multiple recent regulatory filings and statements, Paramount has maintained its guidance to investors that the $8 billion deal would close during the first half of 2025, which ends June 30. Because it is a “controlled” company, with Non-Executive Chairwoman Shari Redstone and her family owning most outstanding shar...",
    "scraped_at": "2025-06-04 03:54:15.690749",
    "has_embedding": true
  },
  {
    "title": "Crypto Bros Celebrate Themselves at Bitcoin’s Most MAGA Convention Yet - Rolling Stone",
    "source": "Rolling Stone",
    "url": "http://www.rollingstone.com/culture/culture-features/bitcoin-2025-maga-lovefest-trump-1235352924/",
    "content_preview": "In another time, the Bitcoin 2025 convention at Las Vegas’ Venetian hotel casino last week might have been most memorable for its cringeworthy moments. There was a group that wore shirts with the slogan “Jesus Loves Bitcoin” on the back. David Bailey, CEO of the parent company of conference host Bitcoin Magazine, tried to buy bitcoin in an on-stage transaction — and it didn’t work. Interludes featured music by a string quartet; they covered the techno instrumental “Sandstorm” by Darude. The comp...",
    "scraped_at": "2025-06-04 03:54:16.476848",
    "has_embedding": true
  },
  {
    "title": "A runway under construction at Newark's beleaguered airport reopens early - NPR",
    "source": "NPR",
    "url": "https://www.npr.org/2025/06/02/nx-s1-5421234/newark-airport-closed-runway-opens-early",
    "content_preview": "A runway under construction at Newark's beleaguered airport reopens early\n\ntoggle caption Kena Betancur/AFP via Getty Images\n\nA runway at Newark Liberty International Airport that had been undergoing renovations for weeks and whose closure contributed to a recent wave of flight delays and cancellations has reopened nearly two weeks ahead of schedule.\n\nOfficials said the resumption of regular runway operations is expected to ease congestion at the airport, which has been struggling with staffing ...",
    "scraped_at": "2025-06-04 03:54:18.026472",
    "has_embedding": true
  },
  {
    "title": "United and JetBlue: How the Blue Sky partnership will help travelers, and where there's room to grow - The Points Guy",
    "source": "The Points Guy",
    "url": "https://thepointsguy.com/news/united-airlines-jetblue-blue-sky-partnership/",
    "content_preview": "United Airlines and JetBlue are teaming up in a new partnership called \"Blue Sky,\" and there's plenty of good news to go around.\n\nJetBlue has the partner it's been looking for. United is headed back to John F. Kennedy International Airport (JFK). And MileagePlus and TrueBlue members just landed a ton of new ways to earn and redeem miles — and have a few more reasons to be excited.\n\nAre there reasons to hold off on too much glee until we see how the airlines' relationship grows in the coming mont...",
    "scraped_at": "2025-06-04 03:54:20.188421",
    "has_embedding": true
  },
  {
    "title": "FDA rolls out AI tool agency-wide, weeks ahead of schedule - statnews.com",
    "source": "STAT",
    "url": "https://www.statnews.com/2025/06/02/fda-artificial-intelligence-implementation-plans-makary/",
    "content_preview": "Brittany Trang, Ph.D., is a health tech reporter at STAT and writes the AI Prognosis newsletter . Follow her on Threads , Mastodon , and Bluesky . You can reach Brittany on Signal at btrang.01.\n\nThe Food and Drug Administration rolled out its agency-wide AI tool on Monday, weeks ahead of schedule. The public announcement provides the most detailed look yet at the technology and how it may be used.\n\nThe public announcement follows a STAT report earlier in the day indicating that the FDA was going...",
    "scraped_at": "2025-06-04 03:54:21.924642",
    "has_embedding": true
  },
  {
    "title": "Snowflake to acquire database startup Crunchy Data - TechCrunch",
    "source": "TechCrunch",
    "url": "https://techcrunch.com/2025/06/02/snowflake-to-acquire-database-startup-crunchy-data/",
    "content_preview": "The surge in data company acquisitions continued Monday with Snowflake’s purchase of Crunchy Data.\n\nCloud data platform Snowflake announced its intent to acquire Crunchy Data, a Postgres database partner, late this afternoon. A source familiar with the matter estimated the deal to be worth around $250 million.\n\nThe terms weren’t disclosed. Snowflake declined to comment on the deal’s valuation.\n\nIt’s the latest in a string of tech giants buying data startups to bolster their underlying database o...",
    "scraped_at": "2025-06-04 03:54:24.247788",
    "has_embedding": true
  },
  {
    "title": "Prediction: Nvidia Will Beat the Market. Here's Why - The Motley Fool",
    "source": "Motley Fool",
    "url": "https://www.fool.com/investing/2025/06/02/prediction-nvidia-will-beat-the-market-heres-why/",
    "content_preview": "The world's leading GPU maker is still a solid investment.\n\nNvidia (NVDA 2.92%), the world's largest producer of discrete graphics processing units (GPUs), saw its stock surge 25,250% over the past 10 years as the S&P 500 advanced less than 180%. From fiscal 2015 to fiscal 2025 (which ended this January), its revenue rose at a compound annual growth rate (CAGR) of 39% as its net income increased at a CAGR of 61%.\n\nThat explosive growth was initially fueled by its brisk sales of gaming GPUs, whic...",
    "scraped_at": "2025-06-04 03:54:25.315016",
    "has_embedding": true
  },
  {
    "title": "Apple drops a spot on 2025 Fortune 500 list - 9to5Mac",
    "source": "9to5Mac",
    "url": "https://9to5mac.com/2025/06/02/apple-drops-a-spot-on-2025-fortune-500-list/",
    "content_preview": "The 2025 edition of the Fortune 500 is out, and Apple once again ranked near the top, while Walmart and Amazon remained firmly planted in first and second place, respectively, for the sixth straight year. Alphabet, meanwhile, was the most profitable company in the top 10.\n\nLanding in 4th place in this year’s Fortune 500 list, Apple has stayed pretty consistent over the past decade. Since 2016, the company has alternated between third and fourth, trading spots with UnitedHealth Group, Exxon Mobil...",
    "scraped_at": "2025-06-04 03:54:26.165001",
    "has_embedding": true
  },
  {
    "title": "Nintendo Switch System Update 20.1.1 Is Now Live, Here Are The Full Patch Notes - nintendolife.com",
    "source": "Nintendo Life",
    "url": "https://www.nintendolife.com/news/2025/06/nintendo-switch-system-update-20-1-1-is-now-live-here-are-the-full-patch-notes",
    "content_preview": "The Switch 2's launch is just around the corner but it hasn't forgotten about the original system (at least yet). After a few updates in May, we've now got the very first firmware patch for June, bumping the system up to Version 20.1.1.\n\nThis appears to be a relatively small update and as explained in the official notes, it resolves an issue with software not starting after the previous update which went live last week. Here's the full rundown, courtesy of Nintendo's support page:\n\nVer. 20.1.1 (...",
    "scraped_at": "2025-06-04 03:54:28.978387",
    "has_embedding": true
  },
  {
    "title": "Xbox sale round-up June 3, 2025 - DLC - TrueAchievements",
    "source": "TrueAchievements",
    "url": "https://www.trueachievements.com/n59172/xbox-sale-roundup-june-3-2025-dlc",
    "content_preview": "New Xbox sales are now live, with big discounts on Grand Theft Auto V, Red Dead Redemption 2, Red Dead Redemption, Assassin's Creed II, Human Fall Flat, Mortal Kombat X, Assassin's Creed Odyssey and more",
    "scraped_at": "2025-06-04 03:54:29.138069",
    "has_embedding": true
  },
  {
    "title": "Court documents reveal OpenAI is coming for your iPhone - 9to5Mac",
    "source": "9to5Mac",
    "url": "https://9to5mac.com/2025/06/02/openai-is-coming-for-your-iphone/",
    "content_preview": "If you’re Apple, this is the kind of internal document that you knew existed, but still hits hard. Especially in the middle of a global antitrust reckoning and internal… whatever the heck is going on in there.\n\nA recently unsealed OpenAI file outlines the company’s ambitions for ChatGPT. In short? They’re coming for Siri with everything they’ve got.\n\nThe super-assistant\n\nThanks to the DOJ’s ongoing case against Google, we now have a rare look at how OpenAI views its competition, and where it see...",
    "scraped_at": "2025-06-04 03:54:30.296850",
    "has_embedding": true
  },
  {
    "title": "Porsche Still Offers The Single Greatest And Possibly Most Excessive Feature In All Of Automobiles - The Autopian",
    "source": "Theautopian.com",
    "url": "https://www.theautopian.com/porsche-still-offers-the-single-greatest-and-possibly-most-excessive-feature-in-all-of-automobiles/",
    "content_preview": "I briefly had a new Porsche 718 Boxster GTS 4.0 in white for the weekend and I was reminded that Porsche still has the one feature that I rarely see on any car. A feature so great and so useful that it should honestly be the norm on every vehicle offered for sale. Why is that? I’m not sure, maybe Porsche has a patent on it, but it seems unlikely.\n\nPart of being an automotive journalist is that you get cars to borrow and, admittedly, some of the features can kind of blur together. Every car has s...",
    "scraped_at": "2025-06-04 03:54:32.562761",
    "has_embedding": true
  },
  {
    "title": "Outfit 3 for Elena, M. Bison, Terry and Mai revealed for Street Fighter 6 - EventHubs",
    "source": "EventHubs",
    "url": "https://www.eventhubs.com/news/2025/jun/02/street-fighter-outfit-3-dlc/",
    "content_preview": "Update: Capcom has now released high-quality screenshots of Street Fighter 6's new costumes that are about to arrive, which you can find in the story below.\n\nThe end of Street Fighter 6 Season 2 is almost here, and it looks like players will be able to dress up the second round of DLC characters in new digs when the time comes too.\n\nCapcom finally just revealed the Outfit 3 options coming to Elena, M. Bison, Terry Bogard and Mai Shiranui in Street Fighter 6.\n\nIt's been over a year since the last...",
    "scraped_at": "2025-06-04 03:54:35.116637",
    "has_embedding": true
  },
  {
    "title": "Microsoft will finally stop bugging Windows users about Edge — but only in Europe - The Verge",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/678350/microsoft-dma-windows-10-11-bing-edge",
    "content_preview": "is a senior editor following news across tech, culture, policy, and entertainment. He joined The Verge in 2021 after several years covering news at Engadget.\n\nMicrosoft’s changes in response to the Digital Markets Act already included allowing Windows machines in the regions it covers to uninstall Edge and remove Bing results from Windows search, but now the list is growing in some meaningful ways. New features announced Monday for Microsoft Windows users in the European Economic Area (the EU pl...",
    "scraped_at": "2025-06-04 03:54:35.751926",
    "has_embedding": true
  },
  {
    "title": "Microsoft belatedly attempts to tame USB-C confusion with its rules for PC OEMs - Ars Technica",
    "source": "Ars Technica",
    "url": "https://arstechnica.com/gadgets/2025/06/microsoft-belatedly-attempts-to-tame-usb-c-confusion-with-its-rules-for-pc-oems/",
    "content_preview": "We've been covering the small, reversible USB Type-C connector since the days when it was just a USB Implementers Forum tech demo, and in the decade-plus since then, the port has gradually taken over the world. It quietly migrated from laptops to game consoles, to PC accessories, to Android phones, to e-readers, and to iPhones. Despite some hiccups and shortcomings, we're considerably closer to a single connector that does everything than we were a decade ago.\n\nBut some confusion persists. A wea...",
    "scraped_at": "2025-06-04 03:54:38.423769",
    "has_embedding": true
  },
  {
    "title": "By Adding This Free Carry Bag to Your Cart, The Anker Solix Power Station Drops 50% in Price on Amazon - Gizmodo",
    "source": "Gizmodo.com",
    "url": "https://gizmodo.com/by-adding-this-free-carry-bag-to-your-cart-the-anker-solix-power-station-drops-50-in-price-on-amazon-2000610249",
    "content_preview": "If you’re looking for the best value on portable power solutions, there’s a unique opportunity on Amazon right now that’s hard to ignore: The Anker Solix C1000 portable power station is a top pick for anyone needing reliable backup power for home, outdoor adventures, or emergencies.\n\nBut the catch: although the power station itself retails at $799, Amazon is having a flash sale on the bundle containing the Solix C1000 and the standard water-resistant carrying case for just $549. That’s an astoni...",
    "scraped_at": "2025-06-04 03:54:40.307431",
    "has_embedding": true
  },
  {
    "title": "WhatsApp is finally getting usernames - 9to5Mac",
    "source": "9to5Mac",
    "url": "https://9to5mac.com/2025/06/02/whatsapp-getting-usernames/",
    "content_preview": "WhatsApp is gearing up to launch a long-awaited feature: usernames. With usernames, users will be able to connect with others without sharing their actual phone number.\n\nSpotted by WABetaInfo (via Tecnoblog) in a recent TestFlight beta version of the app, this under-development feature will finally allow users to pick a unique handle. Yes, just like on Telegram, Signal, and most other modern messaging platforms.\n\nWhile the feature isn’t live yet, even for beta testers, WABetaInfo found strings t...",
    "scraped_at": "2025-06-04 03:54:40.782937",
    "has_embedding": true
  },
  {
    "title": "Microsoft Bing gets a free Sora-powered AI video generator - TechCrunch",
    "source": "TechCrunch",
    "url": "https://techcrunch.com/2025/06/02/microsoft-bing-gets-a-free-sora-powered-ai-video-generator/",
    "content_preview": "Microsoft Bing announced Monday that it is introducing the Bing Video Creator to its app, which uses OpenAI’s Sora model to let users generate videos from text prompts.\n\nOpenAI, which has a long-standing partnership with Microsoft, has locked down access to Sora‘s video generation for paying customers only. Its integration in Microsoft Bing represents the first time that it will be available for free.\n\nImage Credits:Microsoft Bing\n\nAt launch, Bing Video Creator is not yet available on desktop, a...",
    "scraped_at": "2025-06-04 03:54:41.271988",
    "has_embedding": true
  },
  {
    "title": "Google Pixel’s Now Playing feature prepares Quick Settings tile for manual search - 9to5Google",
    "source": "9to5google.com",
    "url": "http://9to5google.com/2025/06/02/google-pixel-now-playing-quick-settings-shortcut-prep/",
    "content_preview": "New findings suggest that, finally, Google Pixel devices may add a manual option to the Now Playing feature by using a new Quick Settings tile.\n\nOne of the longest-running features of Google Pixel phones is “Now Playing,” an ambient feature that automatically detects music in the environment around you and reports it back via your lock screen. It’s a really useful little tool, but also one that hasn’t changed much since its debut on the Pixel 2 series.\n\nIt appears, though, that Google has one qu...",
    "scraped_at": "2025-06-04 03:54:43.026503",
    "has_embedding": true
  },
  {
    "title": "How to watch Apple’s WWDC keynote with iOS 26 and more - 9to5Mac",
    "source": "9to5Mac",
    "url": "https://9to5mac.com/2025/06/02/how-to-watch-wwdc-2025-keynote-with-ios-26-and-more/",
    "content_preview": "WWDC is only one week away. Next Monday, June 9, Apple will unveil its major new OS versions like iOS 26, macOS 26, iPadOS 26, and more—including rumored major redesigns. Here’s how to watch the WWDC 2025 keynote live.\n\nWWDC 2025: Four ways to watch Apple’s keynote\n\nApple kicks off WWDC next week with its biggest happening of the year so far: the keynote event.\n\nWWDC’s 2025 keynote will happen Monday, June 9 at 1:00 p.m. ET / 10:00 a.m. PT and will be live-streamed around the world.\n\nYou can wat...",
    "scraped_at": "2025-06-04 03:54:43.532859",
    "has_embedding": true
  },
  {
    "title": "IO Interactive Showcase Featuring 007 First Light, Hitman, And MindsEye Announced For This Week - Game Informer",
    "source": "Gameinformer.com",
    "url": "https://www.gameinformer.com/2025/06/02/io-interactive-showcase-featuring-007-first-light-hitman-and-mindseye-announced-for-this",
    "content_preview": "Hitman: World of Assassination developer IO Interactive revealed earlier today that its in-development James Bond game is titled “007 First Light.” Now, the studio has announced its first-ever IOI Showcase. It will air this Friday, June 6, and feature Hitman, 007 First Light, Leslie Benzies’ MindsEye, and more.\n\n“IO Interactive, the independent video game developer and publisher behind, among others, the internationally acclaimed Hitman franchise, has announced its first IOI Showcase, a live-str...",
    "scraped_at": "2025-06-04 03:54:44.556628",
    "has_embedding": true
  },
  {
    "title": "Salesforce buys Moonhub, a startup building AI tools for hiring - TechCrunch",
    "source": "TechCrunch",
    "url": "https://techcrunch.com/2025/06/02/salesforce-buys-moonhub-a-startup-building-ai-tools-for-hiring/",
    "content_preview": "Updated 1:13 p.m. Pacific: A Salesforce spokesperson told TechCrunch that Moonhub has not, in fact, been acquired (by the company’s definition of the term). Rather, Moonhub is shutting down, and only some of the company’s team — not the whole team, as MoonHub implied in its post about the news — will be joining Salesforce. The original story follows.\n\nSalesforce has quietly snapped up Moonhub, a startup building AI to vet and hire talent. The terms of the deal weren’t disclosed.\n\nIn a post on Mo...",
    "scraped_at": "2025-06-04 03:54:45.150832",
    "has_embedding": true
  },
  {
    "title": "Samsung could drop Google Gemini in favor of Perplexity for Galaxy S26 - Ars Technica",
    "source": "Ars Technica",
    "url": "https://arstechnica.com/gadgets/2025/06/samsung-could-drop-google-gemini-in-favor-of-perplexity-for-galaxy-s26/",
    "content_preview": "Every smartphone maker is racing to find a way to put AI in your pocket, but no one has cracked the code yet. Samsung was an early supporter of Google's Gemini AI, which has largely supplanted its little-used Bixby assistant. However, a new report claims Samsung is planning a big AI shakeup by partnering with Perplexity on the Galaxy S26.\n\nPerplexity pitches itself as an AI-powered search service, running on the same generative AI technology behind ChatGPT, Gemini, and all the others. However, i...",
    "scraped_at": "2025-06-04 03:54:46.744318",
    "has_embedding": true
  },
  {
    "title": "Patch Notes: New Co-op Emotes! — Warcraft Rumble - Blizzard News",
    "source": "Blizzard.com",
    "url": "https://news.blizzard.com/en-us/article/24204927/patch-notes-new-co-op-emotes",
    "content_preview": "We've added new co-op emotes to help players better communicate during Siege and Raid. We've also addressed issues that have been affecting Rewards, Arclight Energy, War Chest, and Guilds.\n\nPatch Notes: Co-op Fixes This update addresses multiple issues affecting co-op.\n\n3D Print Your Favorite Minis New 3D Printer Blueprints are here!\n\nHeroic Molten Core Grab a partner and dive into the warm and inviting lava pools of Molten Core.\n\nGet ready to smash that button, load up your favorite Minis, and ...",
    "scraped_at": "2025-06-04 03:54:48.022032",
    "has_embedding": true
  },
  {
    "title": "Here’s what Pokémon Scarlet and Violet look like running on Switch 2 - Polygon",
    "source": "Polygon",
    "url": "https://www.polygon.com/pokemon/602862/pokemon-scarlet-and-violet-switch-2-trailer-reveal-upgrade",
    "content_preview": "Since their launch, Pokémon Scarlet and Violet have faced criticism for their subpar performance. But that’s about to change with the newly released free upgrade for the Nintendo Switch 2. In a new trailer, fans just got a first look at the enhanced experience.\n\nIn the trailer above, the visual improvements are immediately noticeable. Character models, once plagued by jagged edges, now appear crisp and polished. The game runs at a smooth 60 frames per second, bringing a new level of fluidity to ...",
    "scraped_at": "2025-06-04 03:54:48.770111",
    "has_embedding": true
  },
  {
    "title": "Google Photos albums redesign adds Material 3 Expressive toolbar, QR code sharing - 9to5Google",
    "source": "9to5google.com",
    "url": "http://9to5google.com/2025/06/02/google-photos-albums-redesign/",
    "content_preview": "Google teased Material 3 Expressive for Photos last month, and one part of it — a redesign of the albums view — is now live on Android. QR code sharing for albums is also now available following last week’s announcement.\n\nUpon opening, the previous design showed an “Add description” field and buttons for Share, Add photos, and Order photos underneath the album cover. That is now gone and replaced by a Material 3 Expressive toolbar.\n\nThat floating toolbar is how you Share, Add photos, and Edit th...",
    "scraped_at": "2025-06-04 03:55:00.388683",
    "has_embedding": true
  },
  {
    "title": "Scientists have discovered a hidden city 140,000 years old at the bottom of the ocean. - Farmingdale Observer",
    "source": "Farmingdale-observer.com",
    "url": "https://farmingdale-observer.com/2025/06/02/scientists-have-discovered-a-hidden-city-140000-years-old-at-the-bottom-of-the-ocean/",
    "content_preview": "The latest climate research reveals a startling reality: approximately half of the world’s population experienced an additional month of extreme heat last year due to human-caused global warming. This alarming finding comes from a comprehensive study published on May 30, 2025, highlighting the accelerating impact of climate change on daily life worldwide.\n\nExtreme heat patterns affecting billions worldwide\n\nAccording to recent scientific data, nearly four billion people—representing 49% of human...",
    "scraped_at": "2025-06-04 03:55:02.638132",
    "has_embedding": true
  },
  {
    "title": "Trump’s budget puts Huntsville-made spacecraft on the chopping block - AL.com",
    "source": "AL.com",
    "url": "https://www.al.com/news/huntsville/2025/06/trumps-budget-puts-huntsville-made-spacecraft-on-the-chopping-block.html",
    "content_preview": "NASA is being directed to phase out multibillion-dollar programs, managed from its flagship center in Huntsville, that are designed to ferry people to and from the moon.\n\nPresident Donald Trump’s budget proposal also calls for a 31% reduction in the space agency’s workforce nationwide, to just under 12,000 personnel, according to documents released last week by the Office of Management and Budget.\n\nThe budget request instead puts emphasis on investing in the private space industry and earmarks $...",
    "scraped_at": "2025-06-04 03:55:04.286591",
    "has_embedding": true
  },
  {
    "title": "NYC summer stargazing seasons kicks off with triangle, meteor showers - Gothamist",
    "source": "Gothamist",
    "url": "https://gothamist.com/news/nyc-summer-stargazing-seasons-kicks-off-with-triangle-meteor-showers",
    "content_preview": "The summer triangle — the quintessential astronomical sign that days are getting longer and hotter — is back in June.\n\nThe harbinger of summer nights comprises three electric-blue stars from three different constellations: Vega from Lyra, Altair from Aquila and Deneb from Cygnus. The triangle is located at the sky's zenith, directly overhead.\n\n“The summer is really the time for the summer triangle,” said Jackie Faherty, an astrophysicist at the American Museum of Natural History.\n\nThe summer sol...",
    "scraped_at": "2025-06-04 03:55:06.131172",
    "has_embedding": true
  },
  {
    "title": "'Strawberry Moon' 2025: June's full moon is about to break an annual record - Live Science",
    "source": "Live Science",
    "url": "https://www.livescience.com/space/the-moon/strawberry-moon-2025-junes-full-moon-is-about-to-break-an-annual-record",
    "content_preview": "Stargazers, get ready for some low-hanging fruit: The full Strawberry Moon is about to rise!\n\nIn addition to being the final full moon of spring in the Northern Hemisphere, June's Strawberry Moon will be the lowest full moon of the year as seen from north of the equator, as well as one of the farthest from the sun.\n\nThe moon will become full at 3:45 a.m. EDT Wednesday (June 11), but because that's so early in the day, the best time to see it will be Tuesday (June 10) evening, when it rises durin...",
    "scraped_at": "2025-06-04 03:55:06.962091",
    "has_embedding": true
  },
  {
    "title": "Forgotten in a collection, the discovery of this fossil presents a real problem for scientists as it doesn't belong to any known living family. - Farmingdale Observer",
    "source": "Farmingdale-observer.com",
    "url": "https://farmingdale-observer.com/2025/06/02/forgotten-in-a-collection-the-discovery-of-this-fossil-presents-a-real-problem-for-scientists-as-it-doesnt-belong-to-any-known-living-family/",
    "content_preview": "In a remarkable scientific discovery, researchers have unearthed a plant fossil that defies conventional botanical classification. This 47-million-year-old specimen, named Othniophyton elongatum, has left paleobotanists puzzled as it appears to belong to no known plant family, either living or extinct. The fossil, forgotten in a university collection until its recent rediscovery, represents what may be an entirely lost lineage in the plant kingdom’s evolutionary history.\n\nThe mysterious Othnioph...",
    "scraped_at": "2025-06-04 03:55:07.739817",
    "has_embedding": true
  },
  {
    "title": "How Rhythm Rewires the Brain Moment by Moment - Neuroscience News",
    "source": "Neurosciencenews.com",
    "url": "https://neurosciencenews.com/rhythm-brain-network-29184/",
    "content_preview": "Summary: When you listen to a steady rhythm, your brain doesn’t just process it—it reconfigures itself in real time. A new study introduces FREQ-NESS, an advanced neuroimaging method that reveals how different frequencies of brainwaves form dynamic networks across the brain.\n\nRather than fixed stations like alpha or beta waves, FREQ-NESS shows that frequencies shift and spread, adapting to sounds and internal states. This approach offers a powerful new way to map the brain with high precision, w...",
    "scraped_at": "2025-06-04 03:55:09.265289",
    "has_embedding": true
  },
  {
    "title": "Scientists identify time and location of first humans who made tools and harpoons out of whale bones - Earth.com",
    "source": "Earth.com",
    "url": "https://www.earth.com/news/scientists-identify-time-and-location-of-first-humans-who-made-tools-and-harpoons-out-of-whale-bones/",
    "content_preview": "Although whale populations are now drastically diminished, they flourished in the distant past. Early humans living near the ocean used whales as a source of food and materials. They also used whale bones to make tools, including harpoons, which where then used to kill more whales.\n\nIt’s hard for scientists today to know exactly when humans started using whales because many of the places where early people lived along the coast have been washed away by the ocean or are underwater now.\n\nSo instea...",
    "scraped_at": "2025-06-04 03:55:11.281371",
    "has_embedding": true
  },
  {
    "title": "Scientists find a boulder weighing 2,645,547 pounds that was washed inland by an enormous tsunami - Earth.com",
    "source": "Earth.com",
    "url": "https://www.earth.com/news/maka-lahi-boulder-weighing-1200-tons-washed-inland-by-an-ancient-tsunami/",
    "content_preview": "Hidden in the greenery of southern Tongatapu sits a boulder so large that locals barely noticed it was out of place. Geologists now say this limestone giant, known as Maka Lahi – Tongan for “Big Rock” – is the heaviest cliff-top boulder ever recorded.\n\nThe rock’s massive presence stands as silent proof that a powerful and devastating tsunami slammed into Tonga approximately 7,000 years ago.\n\nGiant rock found inland\n\nUniversity of Queensland PhD researcher Martin Köhler stumbled on the find almos...",
    "scraped_at": "2025-06-04 03:55:13.035216",
    "has_embedding": true
  },
  {
    "title": "Solar Storms Are Secretly Taking Down Elon Musk’s Satellites - The Daily Galaxy",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/06/solar-storms-elon-musk-satellites/",
    "content_preview": "New research reveals that increased solar activity is shortening the lifespans of SpaceX’s Starlink satellites and causing them to return to Earth at faster speeds. This surprising effect may raise the risk of satellite debris reaching the ground, challenging current assumptions about satellite reentry safety.\n\nSolar Storms Are Cutting Starlink Satellites’ Lifespan\n\nA study led by Denny Oliveira from NASA’s Goddard Space Flight Center examined the reentries of Starlink satellites between 2020 an...",
    "scraped_at": "2025-06-04 03:55:14.163126",
    "has_embedding": true
  },
  {
    "title": "Discover Why These 2025 Milky Way Photos Are Shaking the Astrophotography World - The Daily Galaxy",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/06/2025-milky-way-photos/",
    "content_preview": "The 2025 edition of the Milky Way photographer of the year contest has unveiled a remarkable gallery of night sky images that transport viewers deep into the cosmos. Among the striking entries is a historic photograph of our galaxy taken from an extraordinary vantage point: the International Space Station (ISS). This unique image was captured by NASA astronaut Don Pettit, who recently returned from his latest mission onboard the ISS.\n\nA Stunning Orbital View Of Our Galaxy\n\nThe photograph taken b...",
    "scraped_at": "2025-06-04 03:55:14.990695",
    "has_embedding": true
  },
  {
    "title": "ISS Research & Development Conference Cancellation - NASA Watch",
    "source": "Nasawatch.com",
    "url": "https://nasawatch.com/iss-news/iss-research-development-conference-cancellation/",
    "content_preview": "ISS Research & Development Conference Cancellation\n\nKeith’s note: Space analyst Laura Seward Forczyk just tweeted that the ISS Research & Development Conference has been cancelled. If this is true (and my sources tell me that it really is true) then NASA has decided to stop telling people why LEO research is important. The FY 2026 budget reduces research on ISS – but does not cancel it. OMB documents talk about commercial LEO space stations picking up on that work from ISS. So why not promote a ...",
    "scraped_at": "2025-06-04 03:55:16.806828",
    "has_embedding": true
  },
  {
    "title": "Discovery of 100-million-year-old dinosaur eggs reveals life in Jurassic America - Earth.com",
    "source": "Earth.com",
    "url": "https://www.earth.com/news/100-million-year-old-dinosaur-eggs-show-glimpses-of-life-in-jurassic-america/",
    "content_preview": "Life along the edge of the Western Interior Seaway was anything but quiet 100 million years ago. Seasonal floods crisscrossed low-lying plains, and tangled forests pressed against muddy channels that wound through what is now central Utah.\n\nIn this landscape, dinosaurs and early mammals shared watering holes while ancient crocodile relatives stalked the shallows.\n\nFossils from the Mussentuchit Member of the Cedar Mountain Formation have already painted a bustling scene, yet broken eggshells scat...",
    "scraped_at": "2025-06-04 03:55:18.677489",
    "has_embedding": true
  },
  {
    "title": "\"Unlike Anything We Have Seen Before\": Repeating Signal From Deep In Galactic Plane Puzzles Astronomers - IFLScience",
    "source": "IFLScience",
    "url": "https://www.iflscience.com/unlike-anything-we-have-seen-before-repeating-signal-from-deep-in-galactic-plane-puzzles-astronomers-79439",
    "content_preview": "Astronomers are puzzled after detecting an unusual, repeating long-period transient (LPT) signal emitted deep in the Galactic Plane.\n\nLast year, a team from Australia’s national science agency, CSIRO, found the strange signal using the ASKAP radio telescope on Wajarri Country in Australia. The object, known as ASKAP J1832-0911, appears to emit a pulse of radio waves every 44 minutes.\n\n\"Long-period transients are a recently identified class of cosmic objects that emit bright flashes of radio wave...",
    "scraped_at": "2025-06-04 03:55:20.244485",
    "has_embedding": true
  },
  {
    "title": "Private Japanese spacecraft aims to land in the moon's 'Sea of Cold' this week - Space",
    "source": "Space.com",
    "url": "https://www.space.com/astronomy/moon/private-japanese-spacecraft-will-attempt-to-land-in-the-moons-sea-of-cold-this-week",
    "content_preview": "The Resilience spacecraft captured a stunning view of the moon before its latest orbital control maneuver on May 28, 2025, marking a key step toward its June 5 landing attempt.\n\nThe Japanese company ispace is poised to make a historic moon landing this week.\n\nThe company's Reslience lunar lander will attempt to touch down in Mare Frigoris (\"Sea of Cold\"), a basalt plain in the moon's northern hemisphere, on Thursday (June 5) at 3:24 p.m. EDT (1924 GMT). You'll be able to watch the landing attemp...",
    "scraped_at": "2025-06-04 03:55:21.576288",
    "has_embedding": true
  },
  {
    "title": "The Milky Way may not collide with neighboring galaxy Andromeda after all: 'From near-certainty to a coin flip' - Space",
    "source": "Space.com",
    "url": "https://www.space.com/astronomy/the-milky-way-may-not-collide-with-neighboring-galaxy-andromeda-after-all-from-near-certainty-to-a-coin-flip",
    "content_preview": "A titanic cosmic collision between the Milky Way and its closest large galactic neighbor, Andromeda, may not be as sure a thing as scientists thought.\n\n\n\nPreviously, it had been proposed that there was a good chance that Andromeda and our galactic home, which are moving together, would meet in around 5 billion years and merge to form a daughter galaxy dubbed \"Milkomeda.\"\n\nNew research has revealed that there is a much smaller chance that these two spiral galaxies will slam into each other and me...",
    "scraped_at": "2025-06-04 03:55:22.918761",
    "has_embedding": true
  },
  {
    "title": "Ultra-thin lenses halve incident wavelength to make infrared light visible - Phys.org",
    "source": "Phys.Org",
    "url": "https://phys.org/news/2025-06-ultra-thin-lenses-halve-incident.html",
    "content_preview": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nInfrared light passes through the metal lens and is converted into violet light and focused in a focal point due to the material and the special surface structures—enlarged in the magnifying glass. Credit: Ü.Talts / ETH Zurich\n\nPhysicists at ETH Zurich have developed a lens that can transform infrared light into visi...",
    "scraped_at": "2025-06-04 03:55:24.955132",
    "has_embedding": true
  },
  {
    "title": "AI Finally Cracks Decades-Long Mars Mystery That Has Baffled Scientists - The Daily Galaxy",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/06/ai-cracks-decades-long-mars-mystery/",
    "content_preview": "A new breakthrough in Martian exploration reveals that the mysterious dark streaks spotted on Mars are not signs of flowing water but rather dry dust avalanches, according to a recent study published in Nature Communications. Using advanced artificial intelligence to analyze nearly 500,000 features across the planet, scientists have rewritten a decades-old narrative about Mars’ surface and its potential for habitability. This discovery challenges previous assumptions and highlights the dynamic, ...",
    "scraped_at": "2025-06-04 03:55:25.948556",
    "has_embedding": true
  },
  {
    "title": "What Is the “Dogxim”, the World’s Only Unique Hybrid Animal That Has Scientists Deeply Concerned - Indian Defence Review",
    "source": "Indiandefencereview.com",
    "url": "https://indiandefencereview.com/what-is-the-dogxim-the-worlds-only-unique-hybrid-animal-that-has-scientists-deeply-concerned/",
    "content_preview": "In 2021, near the city of Vacaria in Brazil’s southern Rio Grande do Sul state, a young female canid was found injured after being hit by a car. What initially seemed like an unfortunate accident soon sparked intrigue among veterinarians and scientists. The animal did not resemble any known species—it was neither fully dog nor fully wild fox. Instead, it bore traits of both, revealing a genetic puzzle that challenged established boundaries between domestic and wild canids.\n\nAn Extraordinary Gene...",
    "scraped_at": "2025-06-04 03:55:27.124644",
    "has_embedding": true
  }
]