[
  {
    "title": "23andMe Sets New Auction With $305 Million New Bid From Ex-CEO - Bloomberg",
    "source": "Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-06-05/23andme-sets-new-auction-with-305-million-new-bid-from-ex-ceo",
    "content_preview": "Bankrupt genetic analysis company 23andMe will hold a second auction for its cache of DNA data with an opening bid of $305 million from a group led by the company’s former chief executive officer, Anne Wojcicki.\n\nThe offer is nearly $50 million more than the last bid from Regeneron Pharmaceuticals, which had been declared the winner of the first auction last month, only to have the outcome challenged in court by Wojcicki. The company’s shares climbed as much as 25% to $4.96 once markets opened o...",
    "scraped_at": "2025-06-06 09:04:21.256087",
    "has_embedding": true
  },
  {
    "title": "Amazon planning $10B investment in North Carolina for data center and AI campus - AP News",
    "source": "Associated Press",
    "url": "https://apnews.com/article/amazon-north-carolina-data-center-jobs-338bef3890bb61159e1b6bedfd2efbb5",
    "content_preview": "HAMLET, N.C. (AP) — Amazon plans to invest $10 billion toward building a campus in North Carolina to expand its cloud computing and artificial intelligence infrastructure, bringing a massive shot in the arm to a region where many textile and apparel jobs dried up a generation ago.\n\nAmazon said Wednesday that its investment in rural Richmond County should create at least 500 jobs and support thousands more through construction and data center supply chain providers, according to statements from t...",
    "scraped_at": "2025-06-06 09:04:24.418314",
    "has_embedding": true
  },
  {
    "title": "How airline fees have turned baggage into billions - BBC",
    "source": "BBC News",
    "url": "https://www.bbc.com/news/articles/c0qg3ylx2g9o",
    "content_preview": "How airline fees have turned baggage into billions\n\n1 day ago Share Save Sam Gruet Business reporter Reporting from Toronto Share Save\n\nGetty Images Airlines in the US alone made $7.27bn from check-in luggage fees last year\n\nWith Air Canada and Southwest the latest airlines to charge passengers for check-in luggage, the ballooning cost of such ancillary or \"junk fees\" is provoking anger among politicians and consumer groups. At the same time, sales of suitcases small enough for passengers to tak...",
    "scraped_at": "2025-06-06 09:04:27.534682",
    "has_embedding": true
  },
  {
    "title": "Circle IPO Is Said to Price Above Range to Raise $1.1 Billion - Bloomberg",
    "source": "Bloomberg",
    "url": "https://www.bloomberg.com/news/articles/2025-06-04/circle-ipo-is-said-to-price-above-range-to-raise-1-1-billion",
    "content_preview": "Circle Internet Group Inc. and some of its shareholders raised nearly $1.1 billion in an upsized initial public offering that was priced above a marketed range, in a sign that stablecoin issuers are winning greater acceptance.",
    "scraped_at": "2025-06-06 09:04:29.240630",
    "has_embedding": true
  },
  {
    "title": "Fastest Payout Online Casinos 2025: Black Lotus Expands Customer Payment Options - GlobeNewswire",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/06/04/3094048/0/en/Fastest-Payout-Online-Casinos-2025-Black-Lotus-Expands-Customer-Payment-Options.html",
    "content_preview": "Las Vegas, June 04, 2025 (GLOBE NEWSWIRE) --\n\nAs a move to solidify its position as the fastest payout casino in 2025, Black Lotus has taken a calculated step by expanding its payment systems\n\nBlack Lotus Casino has expanded its payment options for players as part of its expansion plan. This move follows its growth strategy and long-term objective of attracting a wider player base while retaining its current players. In this bold move, Black Lotus has added multiple options and integrated variou...",
    "scraped_at": "2025-06-06 09:04:31.058309",
    "has_embedding": true
  },
  {
    "title": "All flights grounded at Newark Airport due to staffing issues - FOX 5 New York",
    "source": "FOX 5 NY",
    "url": "https://www.fox5ny.com/news/newark-airport-ground-stop-staffing",
    "content_preview": "The Brief The FAA had implemented a ground stop at Newark Liberty International Airport on Wednesday evening due to ongoing staffing shortages, holding all inbound flights at their origin. Newark airport has been limited to 28 arrivals and departures per hour due to construction and staffing issues, with plans to increase this to 34 once runway testing is completed and the runway is certified by June 10. The airport has faced cancellations and delays due to a shortage of air traffic controllers,...",
    "scraped_at": "2025-06-06 09:04:33.306320",
    "has_embedding": true
  },
  {
    "title": "Newport's floating Hooters location is permanently closed - WCPO 9 Cincinnati",
    "source": "WCPO",
    "url": "https://www.wcpo.com/news/local-news/campbell-county/newport-community/newports-floating-hooters-location-is-permanently-closed",
    "content_preview": "NEWPORT, Ky. — The floating Hooters is no more.\n\nWe received a tip that said the Newport location abruptly closed; calling the location led to an automated message that informs callers that location is permanently closed. The business's Google profile also now says \"permanently closed.\"\n\nWe reached out to Hooters, which has filed for Chapter 11 bankruptcy, to ask why the location was closed.\n\n\"After careful consideration of what is needed to best position our company for the future, Hooters made...",
    "scraped_at": "2025-06-06 09:04:35.722937",
    "has_embedding": true
  },
  {
    "title": "Wall Street’s big rally stalls following some discouraging economic data - AP News",
    "source": "Associated Press",
    "url": "https://apnews.com/article/stocks-markets-tariffs-trump-steel-cfaa9c8adc0658ae9a2759c56dc2bde2",
    "content_preview": "NEW YORK (AP) — Wall Street’s big recent rally lost some momentum on Wednesday following a pair of potentially discouraging reports on the economy.\n\nThe S&P 500 finished the day virtually unchanged and remained 2.8% below its all-time high. The Dow Jones Industrial Average fell 91 points, or 0.2%, and the Nasdaq composite added 0.3%.\n\nThe action was stronger in the bond market, where Treasury yields tumbled following the weaker-than-expected economic updates.\n\nOne said that activity contracted f...",
    "scraped_at": "2025-06-06 09:04:38.255134",
    "has_embedding": true
  },
  {
    "title": "Doritos, Cheetos, M&Ms and other popular snacks will soon have warning labels in Texas - KHOU",
    "source": "KHOU.com",
    "url": "https://www.khou.com/article/news/local/texas/texas-junk-food-warning-label/285-df01fbe7-cfe3-4b12-a90b-ec872144e102",
    "content_preview": "Big changes are coming for junk food junkies in the Lone Star State. Here's why.\n\nHOUSTON — Junk food warning labels are coming soon to a store aisle near you.\n\nThe Texas Legislature just approved a bipartisan bill that requires a clear warning for processed snacks, baked goods, drinks and other food. If Governor Greg Abbott signs Senate Bill 25 into law, as expected, it would become effective in 2027.\n\nThe warning is mandatory for all food and drinks that contain additives like food color, blea...",
    "scraped_at": "2025-06-06 09:04:39.866676",
    "has_embedding": true
  },
  {
    "title": "MongoDB (NASDAQ:MDB) Reports Strong Q1, Stock Jumps 14.3% - Yahoo Finance",
    "source": "Yahoo Entertainment",
    "url": "https://finance.yahoo.com/news/mongodb-nasdaq-mdb-reports-strong-201108895.html",
    "content_preview": "Database software company MongoDB (MDB) reported Q1 CY2025 results topping the market’s revenue expectations , with sales up 21.9% year on year to $549 million. The company expects next quarter’s revenue to be around $550.5 million, close to analysts’ estimates. Its non-GAAP loss of $0.46 per share was significantly below analysts’ consensus estimates.\n\nIs now the time to buy MongoDB? Find out in our full research report.\n\nMongoDB (MDB) Q1 CY2025 Highlights:\n\nRevenue: $549 million vs analyst est...",
    "scraped_at": "2025-06-06 09:04:42.331886",
    "has_embedding": true
  },
  {
    "title": "Reddit sues Anthropic, alleging its bots accessed Reddit more than 100,000 times since last July - The Verge",
    "source": "The Verge",
    "url": "https://www.theverge.com/ai-artificial-intelligence/679768/reddit-sues-anthropic-alleging-its-bots-accessed-reddit-more-than-100000-times-since-last-july",
    "content_preview": "is The Verge’s senior AI reporter. An AI beat reporter for more than five years, her work has also appeared in CNBC, MIT Technology Review, Wired UK, and other outlets.\n\nReddit sued Anthropic on Wednesday in San Francisco superior court, claiming that the OpenAI rival had accessed its platform more than 100,000 times since July 2024, after Anthropic allegedly said it had blocked its bots from doing so.\n\nIn the filing, Reddit calls Anthropic a “late-blooming artificial intelligence (‘AI’) company...",
    "scraped_at": "2025-06-06 09:04:45.629488",
    "has_embedding": true
  },
  {
    "title": "Ground beef sold at Whole Foods might be contaminated with E. coli, USDA warns - CNN",
    "source": "CNN",
    "url": "https://www.cnn.com/2025/06/04/health/whole-foods-ground-beef-alert",
    "content_preview": "Food & health Federal agencies Tech giants See all topics Follow\n\nThe US Department of Agriculture’s Food Safety and Inspection Service has issued a public health alert for some raw ground beef products sold at Whole Foods Market because of a risk of E. coli contamination.\n\nThe products are 1-pound, vacuum-packed packages of Organic Rancher organic 85% lean and 15% fat ground beef with use- or freeze-by dates of June 19 or June 20. They came from Vermont-based NPC Processing and have an establis...",
    "scraped_at": "2025-06-06 09:04:48.688307",
    "has_embedding": true
  },
  {
    "title": "PlayStation State of Play June 2025: Everything Announced - IGN",
    "source": "IGN",
    "url": "https://www.ign.com/articles/playstation-state-of-play-june-2025-everything-announced",
    "content_preview": "PlayStation's latest State of Play revealed a bit of the exciting future of PS5, and it included a first look at 007 First Light, the reveal of Arc System Works' Marvel Tokon Fighting Souls, a release date for Silent Hill f, the long-awaited announcement of Final Fantasy Tactics: The Ivalice Chronicles, and much more.\n\nThere were a lot of reveals today, and we're here to gather them all to ensure you don't miss a thing! Let us know what game you are most excited for below!\n\n007 First Light Revea...",
    "scraped_at": "2025-06-06 09:04:54.934389",
    "has_embedding": true
  },
  {
    "title": "New filament lets you 3D-print parts in authentic 1980s Apple computer color - Ars Technica",
    "source": "Ars Technica",
    "url": "https://arstechnica.com/apple/2025/06/new-filament-lets-you-3d-print-parts-in-authentic-1980s-apple-computer-color/",
    "content_preview": "On Tuesday, classic computer collector Joe Strosnider announced the availability of a new 3D-printer filament that replicates the iconic \"Platinum\" color scheme used in classic Macintosh computers from the late 1980s through the 1990s. The PLA filament (PLA is short for polylactic acid) allows hobbyists to 3D-print nostalgic novelties, replacement parts, and accessories that match the original color of vintage Apple computers.\n\nHobbyists commonly feed this type of filament into commercial deskto...",
    "scraped_at": "2025-06-06 09:04:57.484028",
    "has_embedding": true
  },
  {
    "title": "Mortal Kombat: Legacy Kollection announced for Nintendo Switch 2, Switch - Nintendo Everything",
    "source": "Nintendoeverything.com",
    "url": "https://nintendoeverything.com/mortal-kombat-legacy-kollection-announced-for-nintendo-switch-2-switch/",
    "content_preview": "Posted on June 4, 2025 by Brian @NE_Brian ) in News\n\nMortal Kombat: Legacy Kollection is coming to Nintendo Switch 2 and Switch, it’s been announced. The package is launching later in 2025.\n\nMortal Kombat: Legacy Kollection is made by Digital Eclipse, the team behind Atari 50, Tetris Forever, Teenage Mutant Ninja Turtles: The Cowabunga Collection, and more. The collection will feature titles from the arcade, SNES, SEGA Genesis, Game Boy, Game Gear, SEGA 32X, Game Boy Advance, and more. Also incl...",
    "scraped_at": "2025-06-06 09:04:58.469929",
    "has_embedding": true
  },
  {
    "title": "James Bond game 007 First Light gets first trailer - theverge.com",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/679909/007-first-light-trailer-james-bond",
    "content_preview": "Sony’s showcase had a pleasant surprise: the debut trailer for 007 First Light. The James Bond game — which has some definite Uncharted vibes — doesn’t have a release date, but is slated to launch sometime in 2026. And while it was announced at a PlayStation event, the debut trailer confirms it’s coming to Xbox, PC, and the Switch 2 in addition to the PS5.\n\nThe game appears to be an origin story, as players will follow a much younger version of Bond, at least compared to the films. Hitman develo...",
    "scraped_at": "2025-06-06 09:05:00.853223",
    "has_embedding": true
  },
  {
    "title": "Square Enix surprise announced a Final Fantasy Tactics remaster - theverge.com",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/679880/final-fantasy-tactics-remake-square-enix-ps5",
    "content_preview": "Not to be upstaged by all the Nintendo Switch 2 shenanigans, PlayStation decided to steal some of that attention back in the form of a major, nostalgia-fueled announcement: Final Fantasy Tactics is getting a remake and it’s coming in September.\n\nFinal Fantasy Tactics: The Ivalice Chronicles will take players back to a time when Final Fantasy wasn’t an action RPG or even a turn-based RPG but an isometric strategy game. Take control of Ramza Beoulve as he fights in the Lion War and build an army o...",
    "scraped_at": "2025-06-06 09:05:02.553907",
    "has_embedding": true
  },
  {
    "title": "iOS 26 Could Bring Sleep Detection, Camera Controls, and New Gestures to AirPods - MacRumors",
    "source": "MacRumors",
    "url": "https://www.macrumors.com/2025/06/04/ios-26-airpods-rumors/",
    "content_preview": "The iOS 26 and macOS 26 updates could bring several new features to the AirPods, including sleep detection features and camera control options, reports 9to5Mac. The AirPods features would be introduced through firmware updates that would accompany Apple's new software.\n\n\n\nHere's what's rumored:\n\nNew head gestures - Apple could add new head gestures, such as a gesture for adjusting the volume of Conversation Awareness. Last year, Apple added a nod and a head shake to answer or decline calls.\n\n- A...",
    "scraped_at": "2025-06-06 09:05:03.486766",
    "has_embedding": true
  },
  {
    "title": "Meta found 'covertly tracking' Android users through Instagram and Facebook - Sky News",
    "source": "Sky.com",
    "url": "https://news.sky.com/story/meta-found-covertly-tracking-android-users-through-instagram-and-facebook-13379083",
    "content_preview": "Meta and search engine company Yandex have been \"covertly tracking\" Android users in the background of their devices, according to experts.\n\nAcademics at the Radboud University in the Netherlands and IMDEA Networks said they discovered Meta and Yandex have been tracking Android users' browser activity without their consent and then using the data in their apps.\n\nMeta said it was looking into the issue, while Yandex denied collecting any sensitive data.\n\nGunes Acar, assistant professor at Radboud...",
    "scraped_at": "2025-06-06 09:05:04.861359",
    "has_embedding": true
  },
  {
    "title": "Elden Ring Nightreign haters: Bloodborne is right there - Polygon",
    "source": "Polygon",
    "url": "https://www.polygon.com/gaming/602971/elden-ring-nightreign-haters-need-to-pick-up-this-10-year-old-masterpiece",
    "content_preview": "Hunters still return to Yharnam each year in March to celebrate Bloodborne’s anniversary (10 years ago now!), and we still hold out hope for a sequel that might never come. When discussing Bloodborne, however, one thing that doesn’t get mentioned enough are its Chalice Dungeons. They are in some ways a proof of concept for FromSoftware’s weird multiplayer experiments beyond summons and invasions.\n\nChalice Dungeons offer hunters procedurally generated levels of varying difficulties. You can succe...",
    "scraped_at": "2025-06-06 09:05:06.975501",
    "has_embedding": true
  },
  {
    "title": "Your OG Switch Isn’t Quite Dead Yet, Even in the Switch 2 Era - Gizmodo",
    "source": "Gizmodo.com",
    "url": "https://gizmodo.com/your-og-switch-isnt-quite-dead-yet-even-in-the-switch-2-era-2000611066",
    "content_preview": "Don’t abandon your OG Switch just yet, even if you’re jonesing to break the seal on your new Nintendo Switch 2 in the coming days. Overnight, Nintendo dropped a heap of updates to its original Switch games in time for its sequel handheld’s Thursday launch. There’s more beyond compatibility patches streaming to your favorite Switch games for the updated hardware. GameShare may help your Switch 2 become a portal for playing with friends on their older hardware with just a single copy of a game. He...",
    "scraped_at": "2025-06-06 09:05:10.930464",
    "has_embedding": true
  },
  {
    "title": "No Man's Sky Gets A Massive Switch 2 Upgrade And It's All Free - Kotaku",
    "source": "Kotaku",
    "url": "https://kotaku.com/no-mans-sky-beacon-update-switch-2-upgrade-free-1851783539",
    "content_preview": "No Man’s Sky is joining the Switch 2 launch party. The 2016 sci-fi survival sim has spent nearly a decade evolving, and Hello Games announced the live-service game’s latest milestone: a major new update called Beacon and a Switch 2 version that massively improves the game on Nintendo’s platform. The best part is that the upgrade, like all of No Man’s Sky’s updates, is free for fans who already own the game on Switch.\n\nNintendo Switch 2 Could Launch With Almost No Reviews CC Share Subtitles Off\n\n...",
    "scraped_at": "2025-06-06 09:05:12.384373",
    "has_embedding": true
  },
  {
    "title": "Mario Kart World 1.1.0 update out now, patch notes - Nintendo Everything",
    "source": "Nintendoeverything.com",
    "url": "https://nintendoeverything.com/mario-kart-world-1-1-0-update-out-now-patch-notes/",
    "content_preview": "Posted on June 4, 2025 by Brian @NE_Brian ) in News\n\nAlongside the launch of Mario Kart World, Nintendo has prepared a version 1.1.0 update. Those who are starting to get access to Nintendo Switch 2 can download it now.\n\nThe patch brings along various features, including support for the camera and LAN play. Other adjustments have been made, including the lineup of characters that are initially available.\n\nThe full rundown is as follows:\n\nMario Kart World version 1.1.0 update patch notes\n\nAdded s...",
    "scraped_at": "2025-06-06 09:05:13.474775",
    "has_embedding": true
  },
  {
    "title": "CD Projekt Red clarifies Unreal showcase of Witcher 4 was tech demo, not gameplay - GamesIndustry.biz",
    "source": "GamesIndustry.biz",
    "url": "https://www.gamesindustry.biz/cd-projekt-red-clarifies-unreal-showcase-of-witcher-4-was-tech-demo-not-gameplay",
    "content_preview": "CD Projekt Red has emphasised that footage of The Witcher 4 showcased at State of Unreal 2025 was not gameplay.\n\nAs reported by VGC, the developer said it was a \"first look at the cutting edge technology powering The Witcher 4 – but not The Witcher 4 itself\".\n\n\"It showcases the powerful foundation we're building in close collaboration with Epic Games to push open-world design further than ever before, and the core systems and features we're developing using Unreal Engine 5,\" a CDPR spokesperson ...",
    "scraped_at": "2025-06-06 09:05:15.244168",
    "has_embedding": true
  },
  {
    "title": "Samsung confirms the Galaxy Z Fold 7 will bring bigger cover and foldable displays - SamMobile",
    "source": "SamMobile",
    "url": "https://www.sammobile.com/news/qualcomm-snapdragon-7-gen-4-chip-launched/",
    "content_preview": "Qualcomm has unveiled a new Snapdragon processor for premium mid-range phones. It is called the Snapdragon 7 Gen 4 (SM7750-AB), and it brings huge improvements in performance, thanks to a faster CPU, more powerful GPU, and an improved NPU.\n\nLet us understand this chip in more detail below.\n\nSnapdragon 7 Gen 4 specifications\n\nThe Snapdragon 7 Gen 4 is a successor to the Snapdragon 7 Gen 3 that was launched two years ago. Although the new chip is fabbed using the same TSMC 4nm (N4P) process as the...",
    "scraped_at": "2025-06-06 09:05:16.258593",
    "has_embedding": true
  },
  {
    "title": "Heads up! Midnight 16GB 13-inch M4 MacBook Air just dropped again to $800 all-time low ($199 off) - 9to5Toys",
    "source": "9to5Toys",
    "url": "http://9to5toys.com/2025/06/03/midnight-16gb-13-inch-m4-macbook-air/",
    "content_preview": "Update: Walmart has now dropped this model down even lower to to $799.84 shipped. We are expecting Amazon to price match here, but it’s hard to say for sure.\n\nThis one is likely not going to last long folks! Amazon just dropped the most affordable 13-inch M4 MacBook Air in the Midnight color down to a frankly wild $812.13 shipped – this is the lowest ever and the lowest price we have ever tracked online on Apple’s least expensive current-generation MacBook.\n\nWe are going to keep this one short a...",
    "scraped_at": "2025-06-06 09:05:17.959719",
    "has_embedding": true
  },
  {
    "title": "Scientists Crack 30-Year Mystery Behind “Holy Grail” Cancer Drug - SciTechDaily",
    "source": "SciTechDaily",
    "url": "https://scitechdaily.com/?p=478685",
    "content_preview": "A Danish research team has cracked the full biosynthesis of Taxol enabling cheaper and eco-friendly production in yeast. Taxol is one of the most trusted chemotherapy drugs for treating breast, ovarian, cervical, and lung cancers. Yet making this life-saving …",
    "scraped_at": "2025-06-06 09:05:20.299830",
    "has_embedding": true
  },
  {
    "title": "Stop Work Orders At NASA JPL - NASA Watch",
    "source": "Nasawatch.com",
    "url": "https://nasawatch.com/budget/stop-work-orders-at-nasa-jpl/",
    "content_preview": "JPL\n\nKeith’s note: In response to the skinny budget the Surface Biology and Geology development team at NASA JPL has been given a stop work order – all travel, subcontracts, and development is to cease. I am hearing also that Mars Odyssey and Juno teams will also be getting a stop work order soon.",
    "scraped_at": "2025-06-06 09:05:21.461838",
    "has_embedding": true
  },
  {
    "title": "Scientists Uncover “Alien” Chemistry Under Earth’s Largest Lithium Deposits - SciTechDaily",
    "source": "SciTechDaily",
    "url": "https://scitechdaily.com/scientists-uncover-alien-chemistry-under-earths-largest-lithium-deposits/",
    "content_preview": "New research reveals that lithium-rich brines have a chemistry dominated by boron, fundamentally different from typical saline waters. A new study published in Science Advances reveals a surprising twist: much of the world’s lithium is found in salty waters w…",
    "scraped_at": "2025-06-06 09:05:22.466940",
    "has_embedding": true
  },
  {
    "title": "Long, dark 'streaks' spotted on Mars aren't what scientists thought - Live Science",
    "source": "Live Science",
    "url": "https://www.livescience.com/space/mars/long-dark-streaks-spotted-on-mars-arent-what-scientists-thought",
    "content_preview": "Martian \"slope streaks\" spotted by NASA's Mars Reconnaissance Orbiter in 2017. Scientists previously thought these large, discolored features may be signs of running water.\n\nMysterious dark streaks flowing across Mars 's surface may not be the result of running water after all, a new artificial intelligence (AI) analysis suggests.\n\nThe streaks, first observed running along Mars's cliffsides and crater walls by NASA's Viking mission in 1976, were long thought by scientists to have formed as a res...",
    "scraped_at": "2025-06-06 09:05:28.756370",
    "has_embedding": true
  },
  {
    "title": "Nostalgic Tunes Trigger Stronger Urge to Dance Than Familiar Hits - Neuroscience News",
    "source": "Neurosciencenews.com",
    "url": "https://neurosciencenews.com/nostalgia-music-dance-29210/",
    "content_preview": "Summary: A new study reveals that nostalgia plays a powerful role in making us want to dance, even more so than familiarity with a song alone. Researchers asked young adults to rate how much various pop hits made them want to tap, move, or dance, as well as how nostalgic and familiar the songs felt.\n\nWhile both nostalgia and familiarity boosted enjoyment and movement, only nostalgia predicted the urge to dance. The findings suggest that emotionally charged memories may be key to unlocking our gr...",
    "scraped_at": "2025-06-06 09:05:30.277954",
    "has_embedding": true
  },
  {
    "title": "ispace's Resilience spacecraft lands on the moon this week: Here's how to see the landing zone on the lunar surface - Space",
    "source": "Space.com",
    "url": "https://www.space.com/stargazing/ispaces-resilience-spacecraft-lands-on-the-moon-this-week-heres-how-to-see-the-landing-zone-on-the-lunar-surface",
    "content_preview": "The Resilience lunar lander will attempt a soft landing in the Sea of Cold on June 5. (Image credit: NASA)\n\nISpace's private Resilience Lander will attempt to touch down on the Mare Frigoris region of the moon 's surface on June 5, at 3:17 p.m. EDT (1817 GMT). While you won’t be able to see the lander itself from Earth, you can spot its landing zone on the lunar surface — here’s how.\n\nMare Frigoris —Latin for the \"Sea of Cold\" — formed billions of years ago when lava flooded a colossal network o...",
    "scraped_at": "2025-06-06 09:05:32.236380",
    "has_embedding": true
  },
  {
    "title": "Biggest boom since Big Bang: Astronomers uncover most energetic explosions in universe - Phys.org",
    "source": "Phys.Org",
    "url": "https://phys.org/news/2025-06-biggest-boom-big-astronomers-uncover.html",
    "content_preview": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nAn unlucky massive star approaches a supermassive black hole. Credit: University of Hawaiʻi\n\nAstronomers from the University of Hawaiʻi's Institute for Astronomy (IfA) have discovered the most energetic cosmic explosions yet discovered, naming the new class of events \"extreme nuclear transients\" (ENTs). These extraor...",
    "scraped_at": "2025-06-06 09:05:33.965462",
    "has_embedding": true
  },
  {
    "title": "Dinosaurs Had More Than Just Teeth—They Had Cancer, and It’s Changing Everything - The Daily Galaxy",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/06/dinosaurs-had-more-than-just-teeth-they-had-cancer/",
    "content_preview": "Dinosaurs, often depicted as unstoppable creatures of immense strength, were far from immune to the diseases that affect modern animals — including cancer. A groundbreaking new study has revealed that these ancient giants, much like humans, suffered from tumors. The study examines a 70-million-year-old fossil of Telmatosaurus transsylvanicus, a duck-billed dinosaur that once roamed the region now known as Romania.\n\nCancer in Ancient Dinosaurs?\n\nFor years, paleontologists have uncovered fossilize...",
    "scraped_at": "2025-06-06 09:05:35.408878",
    "has_embedding": true
  },
  {
    "title": "What if the Big Bang wasn't the beginning? Research suggests it may have taken place inside a black hole - Phys.org",
    "source": "Phys.Org",
    "url": "https://phys.org/news/2025-06-big-wasnt-black-hole.html",
    "content_preview": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nThe SpaceX Falcon 9 rocket carrying ESA’s Euclid mission on the launch pad in 2023. Credit: https://www.esa.int/Science_Exploration/Space_Science/Euclid, CC BY-SA\n\nThe Big Bang is often described as the explosive birth of the universe—a singular moment when space, time and matter sprang into existence. But what if th...",
    "scraped_at": "2025-06-06 09:05:37.287297",
    "has_embedding": true
  },
  {
    "title": "For the first time, an external factor turns a male mammal into a female - EL PAÍS English",
    "source": "EL PAÍS",
    "url": "https://english.elpais.com/science-tech/2025-06-04/for-the-first-time-an-external-factor-turns-a-male-mammal-into-a-female.html",
    "content_preview": "All living people have been both male and female at the same time for six weeks. Although our sex is determined at the moment the sperm fertilizes the egg, it is not until a month and a half later that the biological programming to develop testes or ovaries is activated.\n\nTextbooks have always taught that this process is 100% dictated by genetics: males have one female and one male chromosome, XY, and females have two female chromosomes, XX. But on Wednesday, the results of a bold experiment wit...",
    "scraped_at": "2025-06-06 09:05:39.178083",
    "has_embedding": true
  },
  {
    "title": "Satellite Footage Captures Mysterious Structure That Looks Like Human Lips - Indian Defence Review",
    "source": "Indiandefencereview.com",
    "url": "https://indiandefencereview.com/satellite-mysterious-structure-human-lips/",
    "content_preview": "In 2012, satellite imagery from Google Earth captured an intriguing and mysterious hill formation in Sudan, which appears to resemble pursed human lips. Located in the arid region of West Darfur, about 60 miles east of the Sudan-Chad border, this unusual formation has piqued the curiosity of both space enthusiasts and geologists. The “landlocked lips,” as it’s become informally known, measures roughly 3,000 feet (900 meters) in length and 1,200 feet (350 meters) at its widest point. This bizarre...",
    "scraped_at": "2025-06-06 09:05:40.879568",
    "has_embedding": true
  },
  {
    "title": "NASA’s Webb Telescope Captures a Stunning New View of the Sombrero Galaxy - The Daily Galaxy",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/06/nasas-webb-telescope-sombrero-galaxy/",
    "content_preview": "NASA’s James Webb Space Telescope has just added to the growing catalog of astronomical discoveries by providing a new perspective on the Sombrero Galaxy. The stunning new image, captured in near-infrared wavelengths, builds upon earlier observations made in mid-infrared light in late 2024. With its massive central bulge of stars and an intriguing dust lane, the Sombrero Galaxy continues to captivate astronomers.\n\nA Glimpse into the Sombrero Galaxy’s Unique Features\n\nThe Sombrero Galaxy, located...",
    "scraped_at": "2025-06-06 09:05:42.411527",
    "has_embedding": true
  },
  {
    "title": "An 'invisible threat': Swarm of hidden 'city killer' asteroids around Venus could one day collide with Earth, simulations show - Live Science",
    "source": "Live Science",
    "url": "https://www.livescience.com/space/asteroids/an-invisible-threat-swarm-of-hidden-city-killer-asteroids-around-venus-could-one-day-collide-with-earth-simulations-show",
    "content_preview": "An unknown number of potential city-killer asteroids could be hiding near Venus and could pose a threat to our planet in the future, new simulations suggest.\n\nA hidden swarm of \"city killer\" space rocks, known as co-orbital asteroids , is likely hiding around Venus and could pose an \"invisible threat\" to Earth over the coming millennia if the asteroids are not found, new simulations suggest. However, there is no immediate danger to our planet, researchers told Live Science.\n\nCo-orbital asteroids...",
    "scraped_at": "2025-06-06 09:05:44.845161",
    "has_embedding": true
  },
  {
    "title": "Early Fire Use Wasn’t for Cooking, New Theory Suggests - Gizmodo",
    "source": "Gizmodo.com",
    "url": "https://gizmodo.com/new-theory-suggests-meat-preservation-not-cooking-drove-early-fire-use-2000611071",
    "content_preview": "Hundreds of thousands—if not over a million—years ago, humans discovered how to make fire. This would prove to be one of the most important advancements in prehistoric human development, but the origin of this vital discovery remains a contentious topic among scholars.\n\nIn a study published last month in the journal Frontiers, researchers from Tel Aviv University proposed a new theory for what prompted humans to start making and controlling fires: to protect their food from animals, and, most no...",
    "scraped_at": "2025-06-06 09:05:46.682018",
    "has_embedding": true
  },
  {
    "title": "NASA Cuts Funding Support For Lunar, Planetary and Space Sciences Conferences - NASA Watch",
    "source": "Nasawatch.com",
    "url": "https://nasawatch.com/space-science-news/nasa-cuts-funding-support-for-lunar-planetary-and-space-sciences-conferences/",
    "content_preview": "Lunar, Planetary and Space Sciences Conferences\n\nKeith’s note: NASA SMD just issued this solicitation notice: in response to Request for Information: Conference on Lunar, Planetary and Space Sciences issued in November 2024: Decision Made Not to Solicit Partnership Proposals – one Q&A response says “NASA will not be providing any financial support to the partner. Under the partnership approach, NASA partners on a collaborative basis with an entity that hosts its own conference. Under this arrang...",
    "scraped_at": "2025-06-06 09:05:47.824880",
    "has_embedding": true
  },
  {
    "title": "This Plant You’ve Never Heard of Can Do What Scientists Thought Was Impossible - SciTechDaily",
    "source": "SciTechDaily",
    "url": "https://scitechdaily.com/this-plant-youve-never-heard-of-can-do-what-scientists-thought-was-impossible/",
    "content_preview": "A study on beetleweed shows that autopolyploid plants with different chromosome sets can coexist, reshaping how scientists understand rapid speciation. About 3.7 billion years ago, a chain of naturally occurring amino acids, similar to those found in meteorit…",
    "scraped_at": "2025-06-06 09:05:48.251258",
    "has_embedding": true
  },
  {
    "title": "34-Million-Year-Old Snake Discovery Unveils Surprising Secrets About Reptile Evolution - Indian Defence Review",
    "source": "Indiandefencereview.com",
    "url": "https://indiandefencereview.com/34-million-year-old-snake-discovery/",
    "content_preview": "Paleontologists have made a groundbreaking discovery in western Wyoming: the nearly complete fossils of a 34-million-year-old snake, Hibernophis breithaupti. This extraordinary find reshapes our understanding of snake evolution, offering new insights into the development of modern snakes. Published in the Zoological Journal of the Linnean Society, this study reveals fascinating details about ancient snake species, their social behaviors, and evolutionary connections to modern boas.\n\nThe fossils,...",
    "scraped_at": "2025-06-06 09:05:50.822575",
    "has_embedding": true
  },
  {
    "title": "Simulations Show What Really Happens When a Black Hole Devours a Neutron Star - Gizmodo",
    "source": "Gizmodo.com",
    "url": "https://gizmodo.com/simulations-show-what-really-happens-when-a-black-hole-devours-a-neutron-star-2000610656",
    "content_preview": "When a black hole and a neutron star finally meet, the result is cosmic carnage—and now, thanks to Caltech’s latest supercomputer simulations, we’re getting a front-row seat to the whole terrifying show.\n\nIn a new pair of studies published in The Astrophysical Journal Letters, researchers led by Caltech astrophysicist Elias Most ran the most detailed simulations to date of neutron star–black hole mergers. These violent events are some of the most extreme in the universe, and the new work reveals...",
    "scraped_at": "2025-06-06 09:05:53.722193",
    "has_embedding": true
  },
  {
    "title": "Massive Asteroid Bigger Than the Empire State Building is Racing Toward Earth - The Daily Galaxy",
    "source": "The Daily Galaxy --Great Discoveries Channel",
    "url": "https://dailygalaxy.com/2025/06/massive-asteroid-bigger-than-the-empire-state-building-is-racing-toward-earth/",
    "content_preview": "On June 5, 2025, a massive asteroid known as 424482 (2008 DG5) is set to pass by Earth. The asteroid, which measures approximately 1,017 to 2,264 feet (310-690 meters) in size, is larger than most asteroids and will be closely monitored as it flies past Earth at a safe distance. For context, this asteroid is larger than the Empire State Building in New York City, one of the tallest buildings in the world. Despite its imposing size, it will pose no danger to Earth, coming within 2.17 million mile...",
    "scraped_at": "2025-06-06 09:05:55.622441",
    "has_embedding": true
  },
  {
    "title": "Dozens of Israeli children develop malignant tumors from sperm donor - The Jerusalem Post",
    "source": "The Jerusalem Post",
    "url": "https://www.jpost.com/health-and-wellness/article-856601",
    "content_preview": "The Health Ministry issued an unusual statement Wednesday regarding a sperm donor who carried a rare genetic mutation that increases the risk of cancer among offspring.\n\nThe ministry urged offspring in their forties and fifties who were born from sperm donations in private clinics in the central region to go directly to one of the genetic institutes across the country for testing as soon as possible.\n\nThe case began several months ago when the family of a deceased sperm donor informed the Health...",
    "scraped_at": "2025-06-06 09:05:58.205332",
    "has_embedding": true
  },
  {
    "title": "Menopause Drug Reduces Breast Cancer Growth In Clinical Trial - ScienceAlert",
    "source": "ScienceAlert",
    "url": "https://www.sciencealert.com/menopause-drug-reduces-breast-cancer-growth-in-clinical-trial",
    "content_preview": "A drug used to relieve the debilitating symptoms of menopause may also be reducing the risk of invasive breast cancer, a new clinical trial by Northwestern University suggests.\n\nAlmost 60,000 women a year are diagnosed with a contained form of breast cancer that can indicate a higher risk of developing invasive tumors later in life.\n\nThe non-invasive cancer is typically detected during routine mammograms, accounts for up to 25 percent of all breast cancer diagnoses, and has a 98 percent recovery...",
    "scraped_at": "2025-06-06 09:06:00.681604",
    "has_embedding": true
  },
  {
    "title": "Microbiome: First bacteria we meet can keep us out of hospital - BBC",
    "source": "BBC News",
    "url": "https://www.bbc.com/news/articles/cgr5lej9l8lo",
    "content_preview": "First bacteria we ever meet can keep us out of hospital\n\n1 day ago Share Save James Gallagher • @JamesTGallagher Health and science correspondent Share Save\n\nGetty Images\n\nThe first bacteria our bodies meet – in the hours after we're born – could protect us from dangerous infections, UK scientists say. They have shown, for the first time, that good bacteria seem to halve the risk of young children being admitted to hospital with lung infections. The researchers said it was a \"phenomenal\" finding...",
    "scraped_at": "2025-06-06 09:06:03.961748",
    "has_embedding": true
  },
  {
    "title": "15 Retinol-Rich Foods To Stimulate Collagen - Vogue",
    "source": "Vogue",
    "url": "https://www.vogue.com/article/retinol-rich-foods",
    "content_preview": "It's a well-known fact that topically applying retinol can make a major difference when it comes to reversing damage to your skin. An active form of vitamin A, retinol is considered the gold-star anti-aging ingredient when it comes to smoothing lines, clearing acne, and reversing sun damage. But you don't have to simply incorporate it into your nighttime routine: Vitamin A is available in your diet, too.\n\n“Diet plays a significant role in our skin’s health and appearance,” says Manhattan-based b...",
    "scraped_at": "2025-06-06 09:06:05.762394",
    "has_embedding": true
  },
  {
    "title": "Pregnant women warned against using weight-loss jabs - BBC",
    "source": "BBC News",
    "url": "https://www.bbc.com/news/articles/cn0gp2pl7zwo",
    "content_preview": "Women warned weight-loss jabs may affect the pill\n\n19 hours ago Share Save Philippa Roxby and Elena Bailey Health reporters Share Save\n\nNatasha Major Natasha stopped taking Mounjaro straight away when she discovered she was pregnant\n\nWomen using weight-loss jabs have been warned by the UK's medicines regulator that they must use effective contraception. The Medicines and Healthcare products Regulatory Agency (MHRA) says it is not known whether taking the medicines, such as Wegovy and Mounjaro, c...",
    "scraped_at": "2025-06-06 09:06:07.397320",
    "has_embedding": true
  }
]